# Notes from PB Python's group-aggregate

[Comprehensive Guide to Grouping and Aggregating with Pandas](https://pbpython.com/groupby-agg.html)

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

# Titanic dataset

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Aggregation

>"Aggregation: takes multiple individual values and returns a summary"

In [3]:
# agg of a single column
df['fare'].agg(['sum', 'mean'])

sum     28693.949300
mean       32.204208
Name: fare, dtype: float64

In [4]:
# agg of multiple columns
df[['fare', 'age']].agg(['sum', 'mean'])

              fare           age
sum   28693.949300  21205.170000
mean     32.204208     29.699118

**Named aggregrations**

You can have different set of agg functions on different columns. Three ways of doing this
- List: What we did above
- Dict (recommended):
- Tuple: one agg per tuple; assign name to output

In [5]:
# dict
df.agg({'fare':['sum', 'mean'], 'sex':['count']})

               fare    sex
sum    28693.949300    NaN
mean      32.204208    NaN
count           NaN  891.0

In [8]:
# tuple
# df.agg(x=('fare', max), y=('fare', 'min'), z=('C', np.mean))

# Groupby

### Basic match

In [9]:
agg_func_math = {'fare': ['sum', 'mean']}
df.groupby(by=['embark_town']).agg(agg_func_math).round(2)

                 fare
                  sum   mean
embark_town
Cherbourg    10072.30  59.95
Queenstown    1022.25  13.28
Southampton  17439.40  27.08

In [11]:
agg_func_math = {'fare':['describe']}
df.groupby(by=['embark_town']).agg(agg_func_math)

                fare                                                 \
            describe
               count       mean        std     min       25%    50%
embark_town
Cherbourg      168.0  59.954144  83.912994  4.0125  13.69795  29.70
Queenstown      77.0  13.276030  14.188047  6.7500   7.75000   7.75
Southampton    644.0  27.079812  35.887993  0.0000   8.05000  13.00



                   75%       max
embark_town
Cherbourg    78.500025  512.3292
Queenstown   15.500000   90.0000
Southampton  27.900000  263.0000

### Counting

In [12]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [13]:
agg_func_count = {'embark_town':['count', 'nunique', 'size']}
# df.groupby(by=['deck']).agg(agg_func_count)
df.agg(agg_func_countc)

     embark_town
           count nunique size
deck
A             15       2   15
B             45       2   47
C             59       3   59
D             33       2   33
E             32       3   32
F             13       3   13
G              4       1    4

### First & Last

In [21]:
agg_func_dict = {'fare': ['first', 'last']}
df.sort_values(by='fare',ascending=False).groupby(by=['embark_town']).agg(agg_func_dict)

                 fare
                first    last
embark_town
Cherbourg    512.3292  4.0125
Queenstown    90.0000  6.7500
Southampton  263.0000  0.0000

In [22]:
#idxmin,max
agg_func_dict = {'fare': ['idxmin', 'idxmax']}
df.groupby(by=['embark_town']).agg(agg_func_dict)

              fare
            idxmin idxmax
embark_town
Cherbourg      378    258
Queenstown     143    245
Southampton    179     27

In [24]:
df.loc[[378, 258]]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
378,0,3,male,20.0,0,0,4.0125,C,Third,man,True,NaN,Cherbourg,no,True
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True

In [26]:
# see rows with max value

df.loc[df.groupby(by='class')['fare'].idxmax()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
72,0,2,male,21.0,0,0,73.5000,S,Second,man,True,NaN,Southampton,no,True
159,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False